#+STARTUP: folded indent inlineimages latexpreview

* Install

- docker-ce (ce = container engine)
- Add repository
#+begin_src shell
sudo apt update
sudo apt install apt-transport-https ca-certificates curl software-properties-common
curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -
sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/ubuntu bionic stable"
#+end_src

- Install
#+begin_src shell
sudo apt update
sudo apt install docker-ce
#+end_src

- [[https://qiita.com/yanoshi/items/dcecbf117d9cbd14af87][WSL上でDocker Engineが動くようになっていたっぽいという話@Qiita]]
- docker deamon is not running ?

* docker グループに追加する (以後、docker コマンドを sudo なしで実行可能)

#+begin_src shell
sudo groupadd docker
sudo usermod -aG docker shun
#+end_src

* Hello world

#+begin_src shell
docker run --rm hello-world
docker images # 確認
#+end_src

* Command

- イメージ取得
  - [[https://hub.docker.com/][docker hub]]
#+begin_src shell
docker pull ubuntu:18.04
#+end_src

- 確認
#+begin_src shell
docker images
docker ps
docker ps -a # -a 停止したコンテナ含む
#+end_src

- 起動 (コンテナに入る)
#+begin_src shell
docker run -i -t ubuntu:18.04 /bin/bash # -it interactive, tty
#+end_src

- バックグラウンドで起動
#+begin_src shell
docker run -i -t -d ubuntu:18.04 /bin/bash # -d バックグラウンド
#+end_src

- 起動済みに接続
#+begin_src shell
docker exec -it <Container ID> /bin/bash
docker attach <Container ID>
# コンテナを停止させずに抜ける => Ctrl-P -> Ctrl-Q
#+end_src

- 再起動
#+begin_src shell
docker restart <Container ID>
#+end_src

- 削除
#+begin_src shell
docker rm <Container ID>
docker rmi <Image name>
#+end_src

- 停止
#+begin_src shell
docker stop <Container ID>
#+end_src

* docker compose

- [[https://qiita.com/bonkoturyu/items/c4cd08dcce3f2b88d4d4][Ubuntu に Docker(+ Docker-Compose) + MySQL を入れる@Qiita]]

#+begin_src shell
# 最新をダウンロード
sudo curl -L "https://github.com/docker/compose/releases/download/1.25.4/docker-compose-$(uname -s)-$(uname -m)" -o /usr/local/bin/docker-compose

# 実行権限を付与
sudo chmod +x /usr/local/bin/docker-compose

#+end_src

- インストール確認
#+begin_src shell :results output
docker-compose --version
#+end_src

#+RESULTS:
: docker-compose version 1.25.4, build 8d51620a
* Container
** [[https://github.com/jaikumarm/docker-iqfeed][jaikumarm/docker-iqfeed]]

#+begin_src shell
docker run \
    -e IQFEED_PRODUCT_ID=SHUN_ASAI_42454 \
    -e IQFEED_LOGIN=LOGIN_ID \
    -e IQFEED_PASSWORD=PASSWORD \
    -p 5009:5010 -p 5901:5901 -p 9100:9101 -p 9300:9301 \
    -v /var/log/iqfeed:/home/wine/DTN/IQFeed \
    -d jaikumarm/iqfeed:v6011

# 自動的に起動
docker run --restart=always \
    -e IQFEED_PRODUCT_ID=SHUN_ASAI_42454 \
    -e IQFEED_LOGIN=LOGIN_ID \
    -e IQFEED_PASSWORD=PASSWORD \
    -p 5009:5010 -p 5901:5901 -p 9100:9101 -p 9300:9301 \
    -v /var/log/iqfeed:/home/wine/DTN/IQFeed \
    -d jaikumarm/iqfeed:v6011
#+end_src

** [[https://hub.docker.com/r/rocker/tidyverse/][rocker/tidyverse]]
*** Reference

- rocker/tidyverse をベースに sshd を追加し、TRAMP で接続する

- ベースとなる ssh docker を選ぶ
  - [[https://bitbucket.org/itscaro/docker/src/04207e3e4402e42f82bae15f4d676f6978d514f1/debian-ssh/Dockerfile?at=master&fileviewer=file-view-default][Docker File]]

- Dockerfile の FROM を rocker/tidyverse に変更

- イメージ作成
#+begin_src shell
docker build -t rocker/ssh .
#+end_src

- 起動
#+begin_src shell
docker run --rm -d -P --name rocker_ssh rocker/ssh
#+end_src

- ポート確認
#+begin_src shell
docker port rocker_ssh
#+end_src

- *ssh を使わない方法もある模様*
  - [[https://stat.ethz.ch/pipermail/ess-help/2017-April/011170.html][[ESS] interacting with Docker]]

*** tidyverse を起動 = 通常利用 (バックグラウンド、Dropbox をマウント)

#+begin_src shell
docker run --rm -e PASSWORD=pass -p 8787:8787 -d -v /home/shun/Dropbox/:/home/rstudio/Dropbox rocker/tidyverse
#+end_src
** MySQL

- [[https://blog.imind.jp/entry/2019/02/15/180512][Ubuntu18.04にDockerを入れてMySQLとPostgreSQLを動かす]]

- イメージを入手
#+begin_src shell
docker pull mysql:latest
#+end_src

#+begin_src shell :results output
docker images
#+end_src

#+RESULTS:
: REPOSITORY          TAG                 IMAGE ID            CREATED             SIZE
: mysql               latest              a7a67c95e831        8 days ago          541MB
: ubuntu              latest              1d622ef86b13        12 days ago         73.9MB
: ubuntu              18.04               c3c304cb4f22        12 days ago         64.2MB
: jaikumarm/iqfeed    v6011               245ce40c4372        10 months ago       1.66GB
: hello-world         latest              fce289e99eb9        16 months ago       1.84kB

- 起動
  - name "mysql-example", port 33306, passwork "hoge" で起動
  - port は通常 3306 番
#+begin_src shell
docker run --name mysql-example -e MYSQL_ROOT_PASSWORD=hoge -p 33306:3306 -d mysql:latest
#+end_src

#+RESULTS:
: 14ef8e555e53225d600698dba7a2ca3672a5cedfd2255a7034abe0562cd9c32c

#+begin_src shell :results output
docker ps
#+end_src

#+RESULTS:
: CONTAINER ID        IMAGE               COMMAND                  CREATED             STATUS              PORTS                                NAMES
: 14ef8e555e53        mysql:latest        "docker-entrypoint.s…"   13 seconds ago      Up 13 seconds       33060/tcp, 0.0.0.0:33306->3306/tcp   mysql-example

- "mysql-example" の mysql に接続
#+begin_src shell
docker exec -it mysql-example mysql -p
# exit; で終了
#+end_src

- localhost から接続するために IP Address を調査
#+begin_src shell
docker inspect mysql-example | grep IPAddress
#+end_src

** PostgreSQL

- [[https://blog.imind.jp/entry/2019/02/15/180512][Ubuntu18.04にDockerを入れてMySQLとPostgreSQLを動かす]]

- イメージを入手
#+begin_src shell :results output
docker pull postgres:latest
#+end_src

#+RESULTS:
: latest: Pulling from library/postgres
: Digest: sha256:d96835c9032988c8a899cb8a3c54467dae81daaa99485de70e8c9bddd5432d92
: Status: Image is up to date for postgres:latest
: docker.io/library/postgres:latest

#+begin_src shell :results output
docker images
#+end_src

#+RESULTS:
: REPOSITORY          TAG                 IMAGE ID            CREATED             SIZE
: mysql               latest              a7a67c95e831        8 days ago          541MB
: ubuntu              latest              1d622ef86b13        12 days ago         73.9MB
: ubuntu              18.04               c3c304cb4f22        12 days ago         64.2MB
: postgres            latest              0f10374e5170        12 days ago         314MB
: jaikumarm/iqfeed    v6011               245ce40c4372        10 months ago       1.66GB
: hello-world         latest              fce289e99eb9        16 months ago       1.84kB

- 起動
  - name "postgres-example", port 54320, passwork "hoge" で起動
  - port は通常 5432 番
#+begin_src shell
docker run --name postgres-example -e POSTGRES_PASSWORD=hoge -p 54320:5432 -d postgres:latest
#+end_src

#+RESULTS:
: efe9889330213125916a2e7018255748b74481670fbb4f9dd4c0bd002762a220

#+begin_src shell
docker exec -it postgres-example psql -Upostgres
#+end_src
